In [1]:
import numpy as np
import pandas as pd

In [4]:
aman = pd.read_csv('aman.csv')

In [5]:
aman

   Train No  Speed     City
0     14006     99    Bihar
1     56009     80    Patna
2     54009     89   shimla
3     14007     70  kondali

In [9]:
aman['Speed'] [0] = 50

C:\Users\AMAN\AppData\Local\Temp\ipykernel_28040\3427302775.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  aman['Speed'] [0] = 50

In [10]:
aman

   Train No  Speed     City
0     14006     50    Bihar
1     56009     80    Patna
2     54009     89   shimla
3     14007     70  kondali

In [12]:
aman.to_csv('aman.csv')

In [13]:
aman.index = ['First', 'Second', 'Third', 'fourth']

In [14]:
aman

        Train No  Speed     City
First      14006     50    Bihar
Second     56009     80    Patna
Third      54009     89   shimla
fourth     14007     70  kondali